[
    {
        "link": "https://www.theguardian.com/us-news/2025/feb/01/los-angeles-palisades-eaton-fires-contained",
        "Provider": "The Guardian",
        "headline": "Los Angeles’ Palisades and Eaton wildfires are now fully contained | California wildfires | The Guardian",
        "content": "The blazes killed 29 people and are estimated to have caused more than $250bn in damages\nThePalisades and Eaton wildfires, which killed at least 29 people and burned across about 60 sq miles (155 sq km) around Los Angeles, have been fully contained.\nCalifornia’s department of forestry and fire protection’sannouncementon Friday came more than three weeks after the two blazes battered this highly populated area of southern California, laying waste toentire neighborhoods– including Pacific Palisades and Altadena. Containment refers to how much of a perimeter has been established around a fire to prevent it from growing,according to NBC News.\nThe Palisades fire erupted on 7 January north of Malibu, in the Pacific Palisades neighborhood. The blaze began as a brush fire and rapidly spread amid southern California’s arid conditions.\nThat night, the Eaton fire broke out inLos Angelescounty. This blaze started in the Angeles national forest’s foothills, according to NBC News and, like the Palisades fire, was fueled by dry conditions.\nThe Palisades fire engulfed 23,448 acres (9,489 hectares) and the Eaton fire burned 14,021 (5,674), officials said, and both infernos were made more powerful by the strong Santa Ana winds. Early estimates puteconomic lossesat more than $250bn.\nAuthorities are now probing the fires’ origins. With the Palisades fire, investigators are studying whether a small fire, which firefighters thought they had extinguished, was rekindled by hurricane-force winds across the area,the Los Angeles Timessaid.\nOfficials investigating the Eaton fire are examining whether utilities played a role. LA superior court judge Ashfaq G Chowdhury ordered Southern California Edison to preserve its equipment, data and evidence related to the Eaton blaze, according to the Times.\nA handful of homeowners have sued Southern California Edison, claiming that its equipment sparked the fire. Authorities are focusing on the base of an electrical tower on an Eaton Canyon hill.\nArea residents recorded photos and video of what could be the first flames from the Eaton fire, which appear to be at the bottom of an electrical transmission tower before it spread downhill toward houses, the Los Angeles Timesreported.\nSouthern California Edison has been linked to multiple wildfires. Investigators determined that faulty equipment spurred 2017’s Thomas fire and2018’s Woolsey fire, which killed three people and caused $6bn in damage.\nSouthern California Edison has said it will cooperate with authorities.\n“While this remains an ongoing investigation, we’re continuing our commitment to transparency and we’ll continue to fully cooperate with the investigation,” Kathleen Dunleavy, a Southern California Edison spokesperson, said.\nCalifornia has previously seen wildfires sparked by other utility equipment. The Camp fire, which left 85 people dead and razed the town of Paradise, started when a century-old piece of power equipment malfunctioned and spewed sparks into brush.\nThe Pacific Gas and Electric utility company pleaded guilty to dozens of counts of involuntary manslaughter and settled with local municipalities for $560m and survivors of the Camp fire, and other fatal infernos, for $13.5bn. Pacific Gas and Electric equipment also caused theZoggand Dixie wildfires in California."
    },
    {
        "link": "https://www.fire.ca.gov/incidents",
        "Provider": "Official Government Source",
        "headline": "Incidents | CAL FIRE",
        "content": "Ongoing emergency responses in California, including all 10+ acre wildfires.\nStructuresDestroyed\nDecember, 2024- Following recent rainfall that has moderated fire activity, CAL FIRE is transitioning to Winter Preparedness staffing levels statewide. This adjustment aligns with a seasonal decrease in fire activity and aims to strategically optimize resources as fire risks lessen during the cooler months.Although California experienced a higher-than-usual number of fires this year, total acreage burned remains slightly below the five-year average but exceeds last year's figures. Forecasts indicate that above-normal temperatures and below-normal precipitation will persist through February, sustaining elevated fire risk, particularly in Southern California. An increased frequency of offshore wind events may also heighten fire concerns in specific areas.\nOver the next several months, an active Jet Stream is expected to bring cool, moist conditions, encouraging the growth of lowland vegetation and snow in higher elevations. These conditions, combined with a shift toward greener fuels, are expected to lower the potential for significant fires over the next 2-3 months. Southern California remains the exception, where some heightened fire risk may persist.Despite these seasonal shifts, CAL FIRE remains vigilant and prepared to respond to any challenges posed by the ongoing elevated fire risk.The resources that CAL FIRE staffs year-round will spend these months engaged in fuel reduction projects and other fire prevention efforts as weather permits.\nIncident data is provided in raw, computer readable formats and requires further processing using specialized software. Two additional API parameters include year (values include a year in the YYYY format) and inactive (values include true and false). CAL FIRE doesn’t provide software development support at this time.\nInformation presented on the departments website is a representation of the existing wildfire situation, based on the information readily available to CAL FIRE. We make every effort to provide accurate and complete information, however the data is subject to review and change. This site provides general information concerning an incident. All of our information comes from the firelines and must be approved by the Incident Commander in charge of managing the incident prior to release. As battling a fire, or handling any other disaster is the priority, updates to these sites cannot be guaranteed on a set time schedule. Please use the information on these pages only as a reference. The sites are not meant to provide up-to-the-minute evacuation or fire behavior information. Please refer to the fire information phone numbers provided on this site, and website links for additional information, and monitor your local radio stations for emergency broadcasts. If you live in a wildland area always have an evacuation plan in place. Fires occur throughout the State within CAL FIRE jurisdiction on a daily basis during fire season. However, the majority of those fires are contained quickly and no information will generally be provided on these incidents at this site if the fire burns less than 10 acres. If you would like to obtain information about a CAL FIRE fire burning in your area that is not included on this web site, please contact the CAL FIRE Unit that services your county."
    },
    {
        "link": "https://www.bbc.com/news/articles/cqld9vqezqeo#:~:text=Nearly%207%2C000%20structures%20were%20levelled,area%20of%20Los%20Angeles%20County.",
        "Provider": "BBC",
        "headline": "FireAid: Billie Eilish, Dr Dre, Katy Perry, Pink and Joni Mitchell perform at benefit concert",
        "content": "Stars including Billie Eilish, Pink, Katy Perry, Nirvana and Dr Dre performed at FireAid on Thursday, a benefit concert in Los Angeles to help the area recover from two of the largest fires in its history.\nMore than 20 artists from various genres took to the stage for the five-hour show, which is happening simultaneously at two large venues in the city and raising money for wildfire relief efforts.\nActor Billy Crystal welcomed the crowd at the Kia forum, wearing clothes he had on when he escaped the Pacific Palisades fire earlier this month.\n\"You'll be hearing from a number of people who were tragically affected by these fires, and I was one of them,\" Crystal said as he opened the show.\nHe had lived in the area for 46 years and spoke poignantly about losing his home.\nCrystal joked that he looked like someone who had just robbed a convenience store, adding that it was important to find moments of humour amid the devastation.\nShortly after the show began at the Kia Forum, a second concert also kicked off at the Intuit Dome, with the online stream switching between the two venues.  Many of the artists who performed are from or based in Los Angeles.\nCalifornia native Katy Perry waved the state's flag as she performed hits such as California Gurls.\nOther stars taking to the stage included No Doubt, from Orange County, and Dr Dre, who performed his anthem California Love, a collaboration with the late 2Pac.\n\"This is a magical moment for me. I've got so much love, you guys... I appreciate all the first responders and all the firemen who put their lives on the line. It's all about love for me today,\" the rapper said.\nEilish duetted with rock band Green Day for a performance of Last Night on Earth. The band's frontman Billie Joe Armstrong told the crowd: \"We're still alive, this is California, and we're all in this together.\n\"From the bottom of our hearts, we love you Los Angeles, and we got your back no matter what.\"\nLater, Eilish was joined by her brother Finneas to perform her own hits including Wildflower and Birds of a Feather.\nElsewhere, Fleetwood Mac singer Stevie Nicks dedicated her Landslide performance to the firefighters who saved her home, and in doing so, likely saved her whole block.\n\"I was a full-on Pacific Palisadean woman with an old, beautiful, famous house that was almost taken from me as the fire came up the hill behind my house,\" Nicks recalled.\n\"And I was pretty sure, as they whisked me away and evacuated me - my least favorite word now - to another safe place, that when I turned around and looked my house would be up in flames.\"\nBut, the singer said her house \"stands strong, just like [me]. And in my opinion, she saved that whole street.\"\nActor Samuel L Jackson also made an appearance, praising the first responders as he introduced the crowd to a firefighter who lost his home in the blaze.\nThe actor then introduced the next musical guest, Rod Stewart, who performed Forever Young and Maggie May.\nAlanis Morisette wore an \"I Love LA\" T-shirt and performed her hit Thank U, which carried a sentiment of gratitude towards firefighters and other key workers.\nThe remaining members of 90s rock band Nirvana, Dave Grohl, Pat Smear and Krist Novoselic also reunited with a series of guest female vocalists such as St Vincent and Sonic Youth's Kim Gordon.\nOther stars appearing at the two shows include Olivia Rodrigo, Earth, Wind & Fire, Gracie Abrams, Sting and Tate McRae.\nJoni Mitchell, 81, made a rare public appearance, performing a rendition of Both Sides Now while sitting ona gold throne.\n\"Mitchell's observation that 'something's lost but something's gained in living every day' was met with a huge cheer. It felt like a dose of regal perspective from one of the all-time greats,\"said the Telegraph's James Hallin his review of the concert.\n\"The song was recorded in LA. And this is where this concert was most effective. The host of songs recorded in, or written about, LA reminded us about the place's musical pedigree and what could all too easily be lost.\"\nRed Hot Chilli Peppers performed their hit Under The Bridge, a paean to Los Angeles, with lyrics such as \"the city, she loves me\" taking on a new poignancy.\nThe night concluded with a performance from Lady Gaga, who delivered a powerful performance of her hit Shallow from the 2018 film A Star Is Born.\nFormer Vice President Kamala Harris was one of the famous faces spotted in the crowd at the Intuit Dome.\nHer husband Doug Emhoff shared a picture taken inside the Intuit Dome on Instagram, with the caption: \"Kamala and I are grateful to be at the FireAid concert tonight in our hometown of Los Angeles.\n\"It is a wonderful night that shows the strength and resilience of our city as we begin to recover and rebuild from the devastating wildfires.\"\nAudiences watching the show were encouraged to donate online. Early in the concert, Crystal revealed that the band U2 had contributed $1m (£804,829).\nProceeds from the concert and donations during the show will go toward rebuilding communities and preventing future fires in the region.\nAt least 29 people died and more than 16,000 homes and businesses were destroyed in the fast-spreading, destructive fires that broke out in early January.\nViewers will be able to donate money to relief efforts during the show, either by text message or via the FireAidLA website.\nDonations will be overseen by the Annenberg Foundation, focusing on both short-term relief efforts and long-term fire prevention projects.\nAdditionally, Connie and Steve Ballmer - who own the LA Clippers basketball team, as well as the Intuit Dome and Forum - will match all donations made during the broadcast.\nThe Palisades and Eaton fires became thelargest fires ever seen in the LA areaearlier this month. Both erupted on 7 January as the region saw a strong wind event, making the small blazes in brushy, mountainous areas hard to contain.\nEmbers travelled miles, igniting whole communities and levelling neighbourhoods.\nNearly 7,000 structures were levelled in the Palisades fire in northwest LA. Another 9,400 were destroyed in the Eaton fire in the Altadena area of Los Angeles County.The fires also claimed a number of victims.\nTrump accuses the US's main trading partners of not addressing concerns over illegal drugs and migration - his main election pledges.\nManchester's Royal Northern School of Music sees composers write music inspired by those with the disease.\nShowrunners say the ceremony will look different as they honour fire victims and first responders.\nEntrepreneurs in the US, Mexico and Canada worry that even a short trade war could push up prices and cost jobs.\nThe Trump administration has asked federal agencies to cull webpages devoted to gender diversity and sexual health.\nCopyright 2025 BBC. All rights reserved.TheBBCisnot responsible for the content of external sites.Read about our approach to external linking."
    },
    {
        "link": "https://inciweb.wildfire.gov/",
        "Provider": "Official Government Source",
        "headline": "InciWeb the Incident Information System",
        "content": "An official website of the United States government\nHere's how you know\nThe .gov means it’s official.Federal government websites often end in .gov or .mil. Before sharing sensitive information, make sure you’re on a federal government site.\nThe site is secure.Thehttps://ensures that you are connecting to the official website and that any information you provide is encrypted and transmitted securely.\nPlease update all bookmarks and links to reflect the new URL for InciWeb: ‘inciweb.wildfire.gov’\nInciWeb\nCould not determine your location.\nLearn More"
    },
    {
        "link": "https://www.fire.ca.gov/incidents/2020",
        "Provider": "Official Government Source",
        "headline": "2020 Fire Season Incident Archive | CAL FIRE",
        "content": "The 2020 California wildfire year was characterized by record-setting wildfires that burned across the state of California as measured during the modern era of wildfire management and record keeping. As of the end of the year, nearly 10,000 fires had burned over 4.2 million acres, more than 4% of the state's roughly 100 million acres of land, making 2020 the largest wildfire season recorded in California's modern history. California's August Complex fire has been described as the first \"gigafire\" as the area burned exceeded 1 million acres. The fire crossed seven counties and has been described as being larger than the state of Rhode Island. On August 19, 2020, California Governor Gavin Newsom reported that the state was battling 367 known fires, many sparked by intense thunderstorms on August 16–17. In early September 2020, a combination of a record-breaking heat wave, and Diablo and Santa Ana winds sparked more fires and explosively grew the active fires, with the August Complex more than doubling the Mendocino Complex's size to become California's largest recorded wildfire.Pictured: The LNU Lightning Complex which burned across wine country in August 2020."
    },
    {
        "link": "https://travel.state.gov/content/travel/en/passports/how-apply/replacing-your-passport-through-the-disaster-recovery-reform-act.html",
        "Provider": "Official Government Source",
        "headline": "Replacing your U.S. Passport after a Disaster",
        "content": "Get a Passport\nRenew or Replace a Passport\nGet My Passport Fast\nPrepare to Apply\nPassport Help\nLegal Matters\nShare this page:\nPassport Forms\nWhat Form Should I use?\nGet Your Processing Time\nPassport Fees\nPassport Photos\nCitizenship Evidence\nPhoto Identification\nWhere to Apply\nReplacing Your Passport After A Disaster\nApplying with a Disability\nWhen you return home after a major disaster, you may find that your passport is lost or damaged. We understand this is a stressful time and are here to help you replace your passport.Federal lawallows us to waive passportapplication and file search feesfor those who have a lost or damaged passport after certain eligible major disasters. The law says:The application fee can be waived for three years after the disaster.The file search fee can be waived for 18 months after the disaster.We can only waive fees for customers who were impacted by disasters listed on this webpage.Your passport fees cannot reimbursed by other sources, such as a homeowner's insurance policy.You will not qualify for a fee waiver if:You've never had a passport.You lost an expired passport.Your passport was lost or damaged in a disaster other than one listed on this webpage.If you are not eligible for a fee waiver, follow the steps on ourApply in Personpage.What makes a passport damaged?Normal \"wear and tear\" such as folded pages or a small bend do not count as damage. Damage includes stains from a liquid, a significant tear, unofficial markings on the data page, missing visa pages (torn out), or a hole punch.\nWhen you return home after a major disaster, you may find that your passport is lost or damaged. We understand this is a stressful time and are here to help you replace your passport.\nFederal lawallows us to waive passportapplication and file search feesfor those who have a lost or damaged passport after certain eligible major disasters. The law says:\nYou will not qualify for a fee waiver if:\nIf you are not eligible for a fee waiver, follow the steps on ourApply in Personpage.\nWhat makes a passport damaged?\nNormal \"wear and tear\" such as folded pages or a small bend do not count as damage. Damage includes stains from a liquid, a significant tear, unofficial markings on the data page, missing visa pages (torn out), or a hole punch.\nCompleteForm DS-5504(Replacement Passport Form)Get anew passport photoCompleteForm DS-64(Lost and Stolen Passport Form). Include:The name of the disaster that caused your lossThe address where you lost your passportThe approximate date when the loss happenedA statement that your passport fees will not be reimbursed by other sources, such as a homeowner's insurance policySubmit your applicationTraveling in more than 3 weeks?Mail Form DS-5504 (with new passport photo) and Form DS-64 to one of the two addresses listed on Page 2 ofForm DS-5504.Traveling in less than 3 weeks?Do not mail your application.Make an appointmentto apply at a passport agency or center. Please note your appointment must be within two weeks of your international travel.\nYou are about to leave travel.state.gov for an external website that is not maintained by the U.S. Department of State.\nLinks to external websites are provided as a convenience and should not be construed as an endorsement by the U.S. Department of State of the views or products contained therein. If you wish to remain on travel.state.gov, click the \"cancel\" message.\nYou are about to visit:\nCancelGO"
    },
    {
        "link": "https://www.ca.gov/lafires/",
        "Provider": "Official Government Source",
        "headline": "2025 Los Angeles Fires | CA.gov",
        "content": "Help and info for people affected by the wildfires\nDeadline for free debris removal: March 31, 2025Learn how to get free debris removal.Debris removal - LA County Recovers\nWe can help you with food, expenses, shelter, and more.\nDisaster Recovery Centers are open in Altadena and UCLA Research Park\n          West.\nFind fire maps, air quality information, and road closure maps.\nLearn when you can return home and how to start recovering.\nBusinesses affected by the fires can get tax relief and extensions.\nGive time or money to help people affected by the fires.\nTake this3-minute surveyto share your needs and tell us what we can improve. You can take it in\n      English or Spanish.\nJanuary 29, 2025\nJanuary 29, 2025\nJanuary 28, 2025\nJanuary 28, 2025\nView all LA fires news\nGovernor Newsomsuspended permit and review requirementsunder the California Environmental Quality Act (CEQA) and the\n          California Coastal Act. This allows victims of the recent fires to\n          restore their homes and businesses faster.\nThe Governorsigned legislationproviding $2.5 billion in immediate disaster relief to support\n          response and recovery efforts.\nOn January 8, California got aMajor Disaster Declarationfor the California wildfires. This lets federal agencies give aid and\n          resources for recovery in the affected areas.\nThrough this declaration from President Biden, California gets\n          assistance for:\n©State of California"
    },
    {
        "link": "https://www.fire.ca.gov/incidents/?os=http&ref=app",
        "Provider": "Official Government Source",
        "headline": "Incidents | CAL FIRE",
        "content": "Ongoing emergency responses in California, including all 10+ acre wildfires.\nStructuresDestroyed\nDecember, 2024- Following recent rainfall that has moderated fire activity, CAL FIRE is transitioning to Winter Preparedness staffing levels statewide. This adjustment aligns with a seasonal decrease in fire activity and aims to strategically optimize resources as fire risks lessen during the cooler months.Although California experienced a higher-than-usual number of fires this year, total acreage burned remains slightly below the five-year average but exceeds last year's figures. Forecasts indicate that above-normal temperatures and below-normal precipitation will persist through February, sustaining elevated fire risk, particularly in Southern California. An increased frequency of offshore wind events may also heighten fire concerns in specific areas.\nOver the next several months, an active Jet Stream is expected to bring cool, moist conditions, encouraging the growth of lowland vegetation and snow in higher elevations. These conditions, combined with a shift toward greener fuels, are expected to lower the potential for significant fires over the next 2-3 months. Southern California remains the exception, where some heightened fire risk may persist.Despite these seasonal shifts, CAL FIRE remains vigilant and prepared to respond to any challenges posed by the ongoing elevated fire risk.The resources that CAL FIRE staffs year-round will spend these months engaged in fuel reduction projects and other fire prevention efforts as weather permits.\nIncident data is provided in raw, computer readable formats and requires further processing using specialized software. Two additional API parameters include year (values include a year in the YYYY format) and inactive (values include true and false). CAL FIRE doesn’t provide software development support at this time.\nInformation presented on the departments website is a representation of the existing wildfire situation, based on the information readily available to CAL FIRE. We make every effort to provide accurate and complete information, however the data is subject to review and change. This site provides general information concerning an incident. All of our information comes from the firelines and must be approved by the Incident Commander in charge of managing the incident prior to release. As battling a fire, or handling any other disaster is the priority, updates to these sites cannot be guaranteed on a set time schedule. Please use the information on these pages only as a reference. The sites are not meant to provide up-to-the-minute evacuation or fire behavior information. Please refer to the fire information phone numbers provided on this site, and website links for additional information, and monitor your local radio stations for emergency broadcasts. If you live in a wildland area always have an evacuation plan in place. Fires occur throughout the State within CAL FIRE jurisdiction on a daily basis during fire season. However, the majority of those fires are contained quickly and no information will generally be provided on these incidents at this site if the fire burns less than 10 acres. If you would like to obtain information about a CAL FIRE fire burning in your area that is not included on this web site, please contact the CAL FIRE Unit that services your county."
    },
    {
        "link": "https://www.usa.gov/replace-vital-documents",
        "Provider": "Official Government Source",
        "headline": "How to replace lost or stolen ID cards | USAGov",
        "content": "An official website of the United States government\nHere's how you know\nOfficial websites use .govA.govwebsite belongs to an official government organization in the United States.\nSecure .gov websites use HTTPSAlock(LockLocked padlock icon) orhttps://means youâve safely connected to the .gov website. Share sensitive information only on official, secure websites.\ncurrent page\nRules for replacing government-issued ID cards vary. Many require you to show an official document, like your birth certificate. This proves your identity or citizenship.\nLAST UPDATED: \n                                            August 20, 2024\nAsk a real person any government-related question for free. They will get you the answer or let you know where to find it.\nAsk USA.gov a question at\nUSAGov is the official guide to government information and services\nAn official website of theU.S. General Services Administration"
    },
    {
        "link": "https://www.fire.ca.gov/incidents/2024",
        "Provider": "Official Government Source",
        "headline": "2024 Fire Season Incident Archive | CAL FIRE",
        "content": "Structures:432 Damaged / 1,716 Destroyed\nThe 2024 fire year in California was marked by significant wildfire activity, exacerbated by a hotter-than-normal June and an abundance of fine fuels resulting from unusually wet winter and spring seasons. This combination rendered vegetation more susceptible to ignition and rapid fire spread, particularly in areas below 3,000 feet where dense growth was observed.\nAmong the thousands of incidents throughout the year, the Park Fire stood out as a particularly devastating event. Ignited on July 24, 2024, in Chico's Bidwell Park, Butte County, the fire was allegedly caused by an act of arson. Despite aggressive initial attack suppression efforts, the fire rapidly expanded, ultimately consuming 429,603 acres across Butte and Tehama counties. The Park Fire led to the destruction of 709 structures and damage to 54 others, prompting widespread evacuations and the temporary closure of Lassen Volcanic National Park.\nOverall, the 2024 fire year highlighted the ongoing need for effective wildfire prevention and mitigation strategies in California, as the state continues to adapt to the impacts of climate change and evolving environmental conditions.\nPictured: a CAL FIRE fire fighter igniting grass during the Forebay VMP burn."
    },
    {
        "link": "https://www.fire.ca.gov/our-impact/statistics",
        "Provider": "Official Government Source",
        "headline": "Statistics | CAL FIRE",
        "content": "Find up-to-date statistics on CA wildfires and CAL FIRE activity. We combine state and federal data to track the number of fires and acres burned in California.\nUpdated as of January 31, 2025*\nCAL FIRE TOTAL INCIDENT RESPONSES: 2025 YTD*Within CAL FIRE jurisdiction only\nCALIFORNIA TOTAL WILDLAND FIRE STATS YTDYear-To-Date (YTD) is for current year, last year, and 5-year average, as of the \"Updated\" date indicated above.\n*Updated weekly from preliminary numbers from our dispatch system and the national Incident Management Situation Report. These numbers may change as we receive more accurate information and remove false alarms.\nA year of progress.A year of successes.A year of perseverance.\nRedbooks have more details about wildfires by jurisdiction. Find large fires, causes of fires, and estimated financial loss due to fires by year.\nCalifornia Incident Data and Statistics Program (CalStats)CalStats@fire.ca.gov(916) 568-3800\n(916) 651-FIRE (3473)CALFIRE.DutyPIO@fire.ca.gov\nNot finding what you are looking for?Submit a Public Records Request."
    },
    {
        "link": "https://www.fema.gov/disaster/4856",
        "Provider": "Official Government Source",
        "headline": "4856 | FEMA.gov",
        "content": "An official website of the United States government\nHere’s how you know\nOfficial websites use .gov\nA.govwebsite belongs to an official government organization in the United States.\nSecure .gov websites use HTTPS\nAlock(LockA locked padlock) orhttps://means you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites.\n              .\nIncident Period:Jan 7, 2025\n                          and continuing.\nDeclaration Date:Jan 8, 2025\nQuick Links\nOn This Page\nHelp for Individuals & Families\nDisaster Recovery Centers\nLocal Resources\nHow to Help\nFunding Obligations\nMore About This Disaster\nIf you have insurance, you should file a claim with your insurance company immediately. FEMA assistance cannot help with losses already covered by insurance. Learn more about thesteps after applying for assistance.\nThe fastest way to apply is throughDisasterAssistance.gov. You can also apply through theFEMA mobile appor by calling the FEMA Helpline at 800-621-3362. If you use a video relay service, captioned telephone service, or other communication services, please provide FEMA the specific number assigned for that service.\nFind help with needs that FEMA is not authorized to provide. Check with your local emergency management officials. The FEMA Helpline (800-621-3362) may be able to provide additional referrals. If you use a video relay service, captioned telephone service, or other communication services, please provide FEMA the specific number assigned for that service.\nAfter applying for assistance, your request is reviewed to determine if aninspectionis needed to verify disaster-related damage to your home and personal property. FEMA staff and inspectors may contact you to discuss your disaster-caused damage.\nFEMA may also request more information to support your eligibility for assistance or information related to your specific disaster-related needs identified in your application. If this is needed, you will receive a letter from FEMA outlining the information needed.\nLearn more about what to expect\nFEMA’s Transitional Sheltering Assistance has been activated for survivors allowing for short-term, emergency sheltering options in participating hotels.\nIn order to receive sheltering assistance, start byapplying for assistance. You must have a FEMA registration ID and approval from FEMA to participate. If FEMA has reached out to you about sheltering assistance, you canlook up participating hotels.\nOnce FEMA has reviewed your application, the results of the inspection and/or documentation submitted, you will get a letter explaining:\nThe letter will be sent to you by email or mail based on what you selected when you completed your application.\nGet answers tofrequently asked questionsabout emergency shelters, disaster assistance, flood insurance and more. Learn more aboutcommon disaster-related rumorsand the facts you need to jumpstart your recovery. Find information on identifyingdisaster fraudand how to report it.\nU.S. Department of Housing and Urban Development (HUD) provides support to a nationwide network ofhousing counseling agencies (HCAs) and certified counselors. HUD-participating HCAs are approved and trained to provide tools to current and prospective homeowners and renters so they can make responsible choices to address their housing needs considering their financial situations.\nYou can findsocial media graphicswith important safety messaging in various languages, including English, Chinese, Spanish and Vietnamese.\nWe also have videos in American Sign Language (ASL) on topics including:Renters May be Eligible for Federal HelpUnderstanding Your Letter\nVisit theNews & Mediapage for events, fact sheets, press releases and other multimedia resources.\nFEMA and our federal partners are on the ground working closely with state and local officials to aid response and early recovery efforts.\nDisaster Recovery Centers are now open for survivors to get in-person help with the application process. To find the nearest DRC, text “DRC” along with your ZIP Code to 43362.\nPeople in Los Angeles County affected by the wildfires should first contact their insurance company and then apply fordisaster assistance.\nContinue to pay close attention to instructions from state and local officials as wildfire response efforts continue.\nState-run and nonprofit shelters are open and partners like the American Red Cross and others are providing a safe place to stay, meals and emotional comfort to people. To find a shelter, text SHELTER and your ZIP code to 43362, visitredcross.org/shelteror call 1-800-RED-CROSS (1-800-733-2767).\nIf you need help reconnecting with loved ones missing after the wildfires:\nAfter a disaster scam artists often attempt to take advantage of disaster survivors. VisitDisaster Fraudfor tips to protect your identity and stay informed. If you believe you are the victim of a scam, report it immediately: emailStopFEMAFraud@fema.dhs.gov, call 1-866-223-0814, or fax 202-212-4926.\nAfter you apply, let us know if anything changes. You can make updates in your online account on DisasterAssistance.gov at any time to do the following:\nYou can also call the FEMA Helpline: 1-800-621-3362 or visit aDisaster Recovery Centerfor in-person assistance.\nYou can check your status atDisasterAssistance.govand upload updated information as needed.\nIf your application status says, “Not Approved,” this can be for a variety of reasons. Check online for a copy of your determination letter that will explain the specific reasons you are not approved. Many times, we just need some extra information, or you may need to correct information.\nFind information on evacuation, shelters, road closures, fire status updates and more:\nReview Safety Tips on Ready.gov\nUse these resources from the Substance Abuse and Mental Health Services Administration (SAMHSA):\nSometimes help can’t wait. If you or someone you know is in danger or having a medical emergency, call 911 or go to your nearest emergency room. If you or someone you know is struggling or in crisis, help is available.  Access the 988 Crisis Lifeline by dialing/texting 988 or chatting at 988lifeline.org. You will speak with a crisis counselor any time of day or night.\nThe helpline is open to anyone experiencing emotional distress related to disasters. This includes survivors of disasters; loved ones of victims; first responders; rescue, recovery, and relief workers; clergy; and parents and caregivers. You may call for yourself or on behalf of someone else.\nYou can call the toll-free, multilingualDisaster Distress Helplinefor confidential counseling, referrals and other support, 24 hours a day, seven days a week. Call or text 1-800-985-5990. Spanish speakers should press “2”. Deaf and hard of hearing ASL callers can text the helpline, or call the hotline using a preferred third party Relay service.\nRecovery can take many years after a disaster. There are many ways to help such as donating cash, needed items or your time.Learn more about how to help those in need.\nDon’t self-deploy to disaster areas.Trusted organizationsin the affected areas know where volunteers are needed. Work with an established organization to make sure you have the appropriate safety, training and skills needed to respond.\nFEMA Voluntary Agency Liaisons (VALs)build relationships and coordinate efforts with voluntary, faith-based and community organizations active in disasters.\nIf you are interested in providing paid services and goods for disaster relief, visit ourDoing Business with FEMA pageto get started.\nIf you own a business involved with debris removal and want to work on clean-up efforts in affected areas, please contact the local government in affected areas to offer your services.\nDisaster Recovery Centers provide disaster survivors with information from FEMA and the U.S. Small Business Administration. Disaster survivors can get help applying for federal assistance, learn about the types of assistance available, learn about the appeals process and get updates on applications.\nSearch for theDisaster Recovery Center (DRC) closest to you.\n540 W Woodbury RdAltadena, California 91001Los AngelesGet Directions\n10850 W Pico BlvdLos Angeles, California 90064Los AngelesGet Directions"
    },
    {
        "link": "https://www.usa.gov/california-wildfires",
        "Provider": "Official Government Source",
        "headline": "California wildfires | USAGov",
        "content": "An official website of the United States government\nHere's how you know\nOfficial websites use .govA.govwebsite belongs to an official government organization in the United States.\nSecure .gov websites use HTTPSAlock(LockLocked padlock icon) orhttps://means youâve safely connected to the .gov website. Share sensitive information only on official, secure websites.\ncurrent page\nLearn how the U.S. government is responding to the Southern California wildfires. Find resources to help you recover from the disaster.\nLos Angeles County residents with wildfire damage may be eligible for FEMA assistance to help cover costs such as paying for essential items, finding a place to stay, replacing personal property, or making basic home repairs. You can apply:\nIf you have insurance, file a claim as soon as possible and be ready to provide your coverage information when applying to FEMA.\nUSDA's Food and Nutrition Service (FNS) announcedtemporary changes to food programs in counties affected by the California wildfires. These may include:\nDuring emergency events such as the Southern California wildfires, U.S. Immigration and Customs Enforcement (ICE) and U.S. Customs and Border Protection (CBP)will not conduct immigration enforcement activities at protected areasincluding:\nLAST UPDATED: \n                                            January 20, 2025\nAsk a real person any government-related question for free. They will get you the answer or let you know where to find it.\nAsk USA.gov a question at\nUSAGov is the official guide to government information and services\nAn official website of theU.S. General Services Administration"
    }
]